// 0. Напишите программу, которая на вход принимает число и
//    выдаёт его квадрат (число умноженное на само себя).

Console.WriteLine ("напишите число: ");

int num = int.Parse(Console.ReadLine());
Console.WriteLine(num*num);
